In [3]:
import numpy as np
import pandas as pd

In [4]:
detail = {'Name': ['Ibrahim Musa', 'Emeka Jude', 'Emmanuel Ayomide','Nnamdi Ike'],
         'Age':[24,25,27,24],
         'Course': ['Physics','Statistics','Mathematics','Chemistry'],
         'Sport':['Football','Volletball','Swimming','BasketBall'],
         'Amount':['20000','25000','20000','456000']}

In [5]:
new_table = pd.DataFrame(detail)

In [6]:
new_table

               Name  Age       Course       Sport  Amount
0      Ibrahim Musa   24      Physics    Football   20000
1        Emeka Jude   25   Statistics  Volletball   25000
2  Emmanuel Ayomide   27  Mathematics    Swimming   20000
3        Nnamdi Ike   24    Chemistry  BasketBall  456000

In [11]:
new_table['Name'].str.upper()

0        IBRAHIM MUSA
1          EMEKA JUDE
2    EMMANUEL AYOMIDE
3          NNAMDI IKE
Name: Name, dtype: object

In [13]:
new_table['Name'].str.cat(sep='_')

'Ibrahim Musa_Emeka Jude_Emmanuel Ayomide_Nnamdi Ike'

In [14]:
"we are learning pandas".split(" ")

['we', 'are', 'learning', 'pandas']

In [15]:
new_table['Name'].str.split(" ")

0        [Ibrahim, Musa]
1          [Emeka, Jude]
2    [Emmanuel, Ayomide]
3          [Nnamdi, Ike]
Name: Name, dtype: object

In [18]:
new_table['Name'].str.split(" ").str.get(0)

0     Ibrahim
1       Emeka
2    Emmanuel
3      Nnamdi
Name: Name, dtype: object

In [21]:
new_table[['First Name' , 'Last Name']] = new_table['Name'].str.split(' ',expand = True)

In [22]:
new_table

               Name  Age       Course       Sport  Amount First Name Last Name
0      Ibrahim Musa   24      Physics    Football   20000    Ibrahim      Musa
1        Emeka Jude   25   Statistics  Volletball   25000      Emeka      Jude
2  Emmanuel Ayomide   27  Mathematics    Swimming   20000   Emmanuel   Ayomide
3        Nnamdi Ike   24    Chemistry  BasketBall  456000     Nnamdi       Ike

In [23]:
new_table.head()

               Name  Age       Course       Sport  Amount First Name Last Name
0      Ibrahim Musa   24      Physics    Football   20000    Ibrahim      Musa
1        Emeka Jude   25   Statistics  Volletball   25000      Emeka      Jude
2  Emmanuel Ayomide   27  Mathematics    Swimming   20000   Emmanuel   Ayomide
3        Nnamdi Ike   24    Chemistry  BasketBall  456000     Nnamdi       Ike

In [25]:
new_table['Amount'].astype(float)
#You convert to float

0     20000.0
1     25000.0
2     20000.0
3    456000.0
Name: Amount, dtype: float64

In [26]:
new_table['Amount'].astype(float).sum()

521000.0

In [27]:
#To count the appearance of alphabets
new_table['Name'].str.lower().str.count('a')

0    2
1    1
2    2
3    1
Name: Name, dtype: int64

In [28]:
# This helps turn the text to lower case,tells if any of the word in column name starts with e 
new_table['Name'].str.lower().str.startswith('e')

0    False
1     True
2     True
3    False
Name: Name, dtype: bool

In [29]:
new_table['Name'].str.lower().str.endswith('e')

0    False
1     True
2     True
3     True
Name: Name, dtype: bool

In [30]:
new_table['Name'].str.lower().str.find('e')

0   -1
1    0
2    0
3    9
Name: Name, dtype: int64